Repository: pancakevirus/nim-lang-081-docs-archived
Catalog: docs/OmegaT/OmegaT-level2.tmx
Source language: en_us
Languages: ja

source: niminst works by reading a configuration file that contains all the information that it needs to generate an installer for the different operating systems.
ja: niminst はコンフィギュレーション・ファイルから各種オペレーティング・システムのインストーラ生成用情報を読み取ることで動作します。

source: nintendoswitch: arm64 """ Authors: "Andreas Rumpf" Description: """This is the Nim Compiler.
ja: nintendoswitch: arm64 """ Authors: "アンドレアス・ルンプフ" Description: """これは Nim コンパイラです。

source: noReturn pragma
ja: noReturn プラグマ

source: noSideEffect pragma
ja: noSideEffect プラグマ

source: nodename*, ## Name of this node within the communications
ja: nodename*, ## 存在するならば、このノードと接続されているときの

source: nodes iterator
ja: nodes イテレータ

source: normalizePath proc
ja: normalizePath プロシージャ

source: normalizedPath proc
ja: normalizedPath プロシージャ

source: note:: available at compile time
ja: 備考:: コンパイル時に利用可能です

source: number of elements in t Source Edit
ja: number of elements in t ソース 編集

source: object file Source Edit
ja: オブジェクトファイル ソース 編集

source: often short for find() >= 0
ja: 大抵は find() >= 0 よりも短いです

source: only search the files with the given extension(s)
ja: 指定された拡張子に該当するファイルのみ検索対象とします。

source: opens a converter that can convert from srcEncoding to destEncoding.
ja: コンバータを開いて srcEncoding から destEncoding へ変換します。

source: opens a database connection.
ja: データベースの接続を開始します。

source: optimize not at all or for speed|size Note: use -d:release for a release build!
ja: 最適化方法: なし (none)、速度重視 (speed)、バイナリサイズ重視 (size) 備考: -d:release を使うとリリースビルドになります！

source: options for regular expressions Source Edit
ja: options for regular expressions ソース 編集

source: options for the RST parser Source Edit
ja: RST パーサーのオプション ソース 編集

source: options for the XML parser Source Edit
ja: options for the XML parser ソース 編集

source: os module
ja: os モジュール

source: os.getCurrentProcessId proc
ja: os.getCurrentProcessId プロシージャ

source: osErrorMsg proc
ja: osErrorMsg プロシージャ

source: osLastError proc
ja: osLastError プロシージャ

source: output an executable, library or object file.
ja: 実行可能ファイル、ライブラリまたはオブジェクトファイルを出力します。

source: output will be ran in memory (no output file) (default) Source Edit
ja: メモリで実行したものを出力します (ファイル出力なし) (デフォルト) ソース 編集

source: outputHandle proc
ja: outputHandle プロシージャ

source: outputStream proc
ja: outputStream プロシージャ

source: overload for values
ja: 値のオーバロード

source: owner(s)
ja: 権利所有者

source: p_aliases*: cstringArray ## A pointer to an array of pointers to
ja: p_aliases*: cstringArray ## 代替プロトコル名の

source: p_proto*: cint ## The protocol number.
ja: p_proto*: cint ## プロトコル番号。

source: parallel,
ja: 並列処理、

source: paramCount proc
ja: paramCount プロシージャ

source: paramStr proc
ja: paramStr プロシージャ

source: parentDir proc
ja: parentDir プロシージャ

source: parentDirs iterator
ja: parentDirs イテレータ

source: parseCmdLine proc
ja: parseCmdLine プロシージャ

source: parseopt module
ja: parseopt モジュール

source: parses an OID.
ja: オブジェクト ID を解析します。

source: parses cookies into a string table.
ja: 文字列テーブルに記載された Cookie を解析します。

source: parses the SQL from input into an AST and returns the AST.
ja: 抽象構文木 (AST) にある input から SQL を解析して AST を返します。

source: path is the string "/usr/bin" (for example), dir is the content of "/usr/bin"; inconsistent right now
ja: path は "/usr/bin" (例えば) の文字列であり、 dir "/usr/bin" の中身です。現時点では一貫性はありません

source: paths to add to the Windows %PATH% environment variable.
ja: 指定のパスを Windows の環境変数 %PATH% へ追加します。

source: pattern is a peg
ja: PEG パターンを使用します。

source: pattern is a regular expression (default); extended syntax for the regular expression is always turned on
ja: 正規表現パターンを使用します (デフォルト)。正規表現の拡張構文は常時有効です。

source: poInteractive, ## Optimize the buffer handling for responsiveness for
ja: poInteractive, ## GUI アプリケーションのレスポンス用に

source: poUsePath, ## Asks system to search for executable using PATH environment
ja: poUsePath, ## 環境変数 PATH から実行可能ファイルを検索するよう

source: port type Source Edit
ja: port type ソース 編集

source: possible JSON node types Source Edit
ja: possible JSON node types ソース 編集

source: possible SEXP node types Source Edit
ja: 利用可能な SEXP ノードの種類 ソース 編集

source: pragma pragma
ja: pragma プラグマ

source: preprocessed file (used internally) Source Edit
ja: プリプロセス後のファイル (内部処理で使用) ソース 編集

source: process directories recursively
ja: ディレクトリを再帰的に処理します。

source: process exec'd Source Edit
ja: process exec'd ソース 編集

source: process exited Source Edit
ja: process exited ソース 編集

source: process forked Source Edit
ja: process forked ソース 編集

source: pure pragma
ja: pure プラグマ

source: push and pop pragmas
ja: push と pop プラグマ

source: pushes a value x for processing Source Edit
ja: pushes a value x for processing ソース 編集

source: pushes two values x and y for processing Source Edit
ja: pushes two values x and y for processing ソース 編集

source: putEnv proc
ja: putEnv プロシージャ

source: puts a (key, value)-pair into t.
ja: (key, value) ペアを t に追加します。

source: raiseOSError proc
ja: raiseOSError プロシージャ

source: raised by the to macro if the JSON kind is incorrect.
ja: JSON の種類が間違っているときに to マクロで発生します。

source: raised if an invalid PEG has been detected Source Edit
ja: raised if an invalid PEG has been detected ソース 編集

source: raises a DbError exception.
ja: DbError 例外を発生させます。

source: raises an EInvalidLibrary exception.
ja: EInvalidLibrary 例外を発生させます。

source: raises an EJsonParsingError exception.
ja: EJsonParsingError 例外を発生させます。

source: raises an ESexpParsingError exception.
ja: ESexpParsingError 例外を発生させます。

source: raises an DbError exception with message msg.
ja: メッセージ msg 付きで DbError の例外を発生します。

source: raises an ECgi exception with message msg.
ja: メッセージ msg 付きで ECgi 例外を発生させます。

source: read n lines from the file named filename.
ja: ファイル名 filename から n 行を読み取ります。

source: read pattern from stdin (to avoid the shell's confusing quoting rules)
ja: 標準入力からパターンを読み取ります (紛らわしいシェルのクォート処理ルール対策)。

source: reads len bytes into the buffer a starting at a[start].
ja: a[start] を始点としてバッファ a に len バイトを読み取ります。

source: reads len bytes into the buffer pointed to by buffer.
ja: buffer により指されたバッファから len バイトを読み取ります。

source: reads a line of text from the file f into line.
ja: ファイル f にある line からテキストを一行読み取ります。

source: reads a line of text from the file f.
ja: ファイル f からテキストを一行読み取ります。

source: realtime setting.
ja: 追加ドキュメンテーションです。

source: register pragma
ja: register プラグマ

source: relativePath proc
ja: relativePath プロシージャ

source: removeDir proc
ja: removeDir プロシージャ

source: removeFile proc
ja: removeFile プロシージャ

source: removes key (and its associated value) from the set c.
ja: key (および関連値) を集合 c から削除します。

source: renders n into its string representation and appends to result.
ja: n を文字列形式に翻訳して result へ追加します。

source: reopens the file f with given filename and mode.
ja: filename と mode を指定してファイル f を開き直します。

source: replace the pattern
ja: 置換パターン

source: represent slice of a MemFile for iteration over delimited lines/records Source Edit
ja: represent slice of a MemFile for iteration over delimited lines/records ソース 編集

source: represents a memory mapped file Source Edit
ja: represents a memory mapped file ソース 編集

source: reset r Source Edit
ja: reset r ソース 編集

source: reset s Source Edit
ja: reset s ソース 編集

source: result for readLineAsync Source Edit
ja: result for readLineAsync ソース 編集

source: result not representable due to overflow Source Edit
ja: result not representable due to overflow ソース 編集

source: result not representable due to underflow Source Edit
ja: result not representable due to underflow ソース 編集

source: resume proc
ja: resume プロシージャ

source: retrieves a single row.
ja: 一行取得します。

source: retrieves the address of a procedure/variable from lib.
ja: lib からプロシージャ / 変数のアドレスを取得します。

source: retrieves the current column.
ja: 現在の桁を取得します。

source: retrieves the current encoding.
ja: 現在のエンコーディングを取得します。

source: retrieves the current line.
ja: 現在の行を取得します。

source: retrieves the current position of the file pointer that is used to read from the file f.
ja: ファイル f からの読み取り使われるファイルポインタの現在位置を取得します。

source: retrieves the file size (in bytes) of f.
ja: f のファイルサイズを取得します (バイト単位)。

source: retrieves the first/next event.
ja: first/next イベントを取得します。

source: retrieves the value at c[key].
ja: c[key] の値を取得します。

source: return symbol value or NULL if not found Source Edit
ja: シンボル値、または見つからないときは NULL を返します ソース 編集

source: return the string representation of address within sockAddr Source Edit
ja: return the string representation of address within sockAddr ソース 編集

source: return tuple of generic params for generic T
ja: ジェネリック型 T においてジェネリック型パラメータのタプルを返します

source: returns -1 on error and required size if ptr is NULL Source Edit
ja: ptr が NULL ならばエラーであり要求されたサイズとして -1 を返します ソース 編集

source: returns a helpful error message for the event jsonError Source Edit
ja: jsonError イベントの手掛かりとなるエラーメッセージを返します ソース 編集

source: returns a helpful error message for the event sexpError Source Edit
ja: sexpError イベントで有用なエラーメッセージを返します ソース 編集

source: returns a helpful error message for the event xmlError Source Edit
ja: returns a helpful error message for the event xmlError ソース 編集

source: returns an error message "e expected" in the same format as the other error messages Source Edit
ja: ほかのエラーメッセージと同じ書式でエラーメッセージ "e expected" を返します ソース 編集

source: returns an error message "<tag> expected" in the same format as the other error messages Source Edit
ja: returns an error message "<tag> expected" in the same format as the other error messages ソース 編集

source: returns an error message with text msg in the same format as the other error messages Source Edit
ja: returns an error message with text msg in the same format as the other error messages ソース 編集

source: returns contents of the CONTENT_LENGTH environment variable Source Edit
ja: 環境変数 CONTENT_LENGTH の内容を返します ソース 編集

source: returns contents of the CONTENT_TYPE environment variable Source Edit
ja: 環境変数 CONTENT_TYPE の内容を返します ソース 編集

source: returns contents of the DOCUMENT_ROOT environment variable Source Edit
ja: 環境変数 DOCUMENT_ROOT の内容を返します ソース 編集

source: returns contents of the GATEWAY_INTERFACE environment variable Source Edit
ja: 環境変数 GATEWAY_INTERFACE の内容を返します ソース 編集

source: returns contents of the HTTP_ACCEPT environment variable Source Edit
ja: 環境変数 HTTP_ACCEPT の内容を返します ソース 編集

source: returns contents of the HTTP_ACCEPT_CHARSET environment variable Source Edit
ja: 環境変数 HTTP_ACCEPT_CHARSET の内容を返します ソース 編集

source: returns contents of the HTTP_ACCEPT_ENCODING environment variable Source Edit
ja: 環境変数 HTTP_ACCEPT_ENCODING の内容を返します ソース 編集

source: returns contents of the HTTP_ACCEPT_LANGUAGE environment variable Source Edit
ja: 環境変数 HTTP_ACCEPT_LANGUAGE の内容を返します ソース 編集

source: returns contents of the HTTP_CONNECTION environment variable Source Edit
ja: 環境変数 HTTP_CONNECTION の内容を返します ソース 編集

source: returns contents of the HTTP_COOKIE environment variable Source Edit
ja: 環境変数 HTTP_COOKIE の内容を返します ソース 編集

source: returns contents of the HTTP_HOST environment variable Source Edit
ja: 環境変数 HTTP_HOST の内容を返します ソース 編集

source: returns contents of the HTTP_REFERER environment variable Source Edit
ja: 環境変数 HTTP_REFERER の内容を返します ソース 編集

source: returns contents of the HTTP_USER_AGENT environment variable Source Edit
ja: 環境変数 HTTP_USER_AGENT の内容を返します ソース 編集

source: returns contents of the PATH_INFO environment variable Source Edit
ja: 環境変数 PATH_INFO の内容を返します ソース 編集

source: returns contents of the PATH_TRANSLATED environment variable Source Edit
ja: 環境変数 PATH_TRANSLATED の内容を返します ソース 編集

source: returns contents of the QUERY_STRING environment variable Source Edit
ja: 環境変数 QUERY_STRING の内容を返します ソース 編集

source: returns contents of the REMOTE_ADDR environment variable Source Edit
ja: 環境変数 REMOTE_ADDR の内容を返します ソース 編集

source: returns contents of the REMOTE_HOST environment variable Source Edit
ja: 環境変数 REMOTE_HOST の内容を返します ソース 編集

source: returns contents of the REMOTE_IDENT environment variable Source Edit
ja: 環境変数 REMOTE_IDENT の内容を返します ソース 編集

source: returns contents of the REMOTE_PORT environment variable Source Edit
ja: 環境変数 REMOTE_PORT の内容を返します ソース 編集

source: returns contents of the REMOTE_USER environment variable Source Edit
ja: 環境変数 REMOTE_USER の内容を返します ソース 編集

source: returns contents of the REQUEST_METHOD environment variable Source Edit
ja: 環境変数 REQUEST_METHOD の内容を返します ソース 編集

source: returns contents of the REQUEST_URI environment variable Source Edit
ja: 環境変数 REQUEST_URI の内容を返します ソース 編集

source: returns contents of the SCRIPT_FILENAME environment variable Source Edit
ja: 環境変数 SCRIPT_FILENAME の内容を返します ソース 編集

source: returns contents of the SCRIPT_NAME environment variable Source Edit
ja: 環境変数 SCRIPT_NAME の内容を返します ソース 編集

source: returns contents of the SERVER_ADDR environment variable Source Edit
ja: 環境変数 SERVER_ADDR の内容を返します ソース 編集

source: returns contents of the SERVER_ADMIN environment variable Source Edit
ja: 環境変数 SERVER_ADMIN の内容を返します ソース 編集

source: returns contents of the SERVER_NAME environment variable Source Edit
ja: 環境変数 SERVER_NAME の内容を返します ソース 編集

source: returns contents of the SERVER_PORT environment variable Source Edit
ja: 環境変数 SERVER_PORT の内容を返します ソース 編集

source: returns contents of the SERVER_PROTOCOL environment variable Source Edit
ja: 環境変数 SERVER_PROTOCOL の内容を返します ソース 編集

source: returns contents of the SERVER_SIGNATURE environment variable Source Edit
ja: 環境変数 SERVER_SIGNATURE の内容を返します ソース 編集

source: returns contents of the SERVER_SOFTWARE environment variable Source Edit
ja: 環境変数 SERVER_SOFTWARE の内容を返します ソース 編集

source: returns current C/C++ function name Source Edit
ja: 現在の C/C++ 関数名を返します ソース 編集

source: returns number of columns in the row Source Edit
ja: 指定された行にある列の数値を返します ソース 編集

source: returns number of variadic arguments in x Source Edit
ja: returns number of variadic arguments in x ソース 編集

source: returns text for given column of the row Source Edit
ja: 指定された行にある列のテキストを返します ソース 編集

source: returns the OS file handle of the file f.
ja: ファイル f のオペレーティング・システムにおけるファイルハンドルを返します。

source: returns the character data for the events: jsonInt, jsonFloat, jsonString Source Edit
ja: イベントの文字データを返します: jsonInt, jsonFloat, jsonString ソース 編集

source: returns the character data for the events: sexpInt, sexpFloat, sexpString Source Edit
ja: イベントの文字データを返します: sexpInt, sexpFloat, sexpString ソース 編集

source: returns the current event type for the JSON parser Source Edit
ja: JSON パーサーにおける現在のイベント型を返します ソース 編集

source: returns the current event type for the SEXP parser Source Edit
ja: SEXP パーサーにおける現在のイベント型を返します ソース 編集

source: returns the current event type for the XML parser Source Edit
ja: returns the current event type for the XML parser ソース 編集

source: returns the effective group ID of the calling process Source Edit
ja: 呼び出しプロセスの実効グループ ID を返します ソース 編集

source: returns the effective user ID of the calling process Source Edit
ja: 呼び出しプロセスの実効ユーザ ID を返します ソース 編集

source: returns the file handle of the file f.
ja: ファイル f のファイルハンドルを返します。

source: returns the generated timestamp of the OID.
ja: 生成されたオブジェクト ID のタイムスタンプを返します。

source: returns the length of a widestring.
ja: widestring (ワイド文字列) の長さを返します。

source: returns the number for the event: jsonFloat Source Edit
ja: イベント数を返します: jsonFloat ソース 編集

source: returns the number for the event: jsonInt Source Edit
ja: イベント数を返します: jsonInt ソース 編集

source: returns the number for the event: sexpFloat Source Edit
ja: イベント数を返します: sexpFloat ソース 編集

source: returns the number for the event: sexpInt Source Edit
ja: イベント数を返します: sexpInt ソース 編集

source: returns the number of elements in c in O(1).
ja: O(1) により c の要素数を返します。

source: returns the number of the processors/cores the machine has.
ja: マシンに搭載されているプロセッサ / コア数を返します。

source: returns the port number as a string Source Edit
ja: returns the port number as a string ソース 編集

source: returns the process ID (PID) of the calling process Source Edit
ja: 呼び出しプロセスのプロセス ID (PID) を返します ソース 編集

source: returns the process ID of the parent of the calling process Source Edit
ja: 呼び出しプロセスの親プロセス ID を返します ソース 編集

source: returns the real group ID of the calling process Source Edit
ja: 呼び出しプロセスの実グループ ID を返します ソース 編集

source: returns the real user ID of the calling process Source Edit
ja: 呼び出しプロセスの実ユーザ ID を返します ソース 編集

source: returns the session ID of the calling process Source Edit
ja: 呼び出しプロセスのセッション ID を返します ソース 編集

source: returns true if s ends with the pattern suffix Source Edit
ja: returns true if s ends with the pattern suffix ソース 編集

source: returns true if s starts with the pattern prefix Source Edit
ja: returns true if s starts with the pattern prefix ソース 編集

source: returns true iff c contains the given key.
ja: c に指定された key がある場合に限り true を返します。

source: returns which message class k belongs to.
ja: メッセージクラス k の所属先を返します。

source: reverses type T = distinct A; works recursively.
ja: type T = distinct A を反転します。これは再帰処理を行います。

source: round to nearest Source Edit
ja: round to nearest ソース 編集

source: round toward +Inf Source Edit
ja: round toward +Inf ソース 編集

source: round toward -Inf Source Edit
ja: round toward -Inf ソース 編集

source: round toward 0 Source Edit
ja: round toward 0 ソース 編集

source: run a Nimscript file
ja: Nimscript ファイルを実行します

source: run the compiled program with given arguments
ja: 引数を指定してコンパイル後のプログラムを実行します

source: run your program as usual.
ja: いつも通りプログラムを実行します。

source: runs the query (typically "UPDATE") and returns the number of affected rows Source Edit
ja: クエリを実行後 (通常は "UPDATE") に処理対象となった行数を返します ソース 編集

source: runtime type information:
ja: 実行時型情報:

source: s_name*: cstring ## Official name of the service.
ja: s_name*: cstring ## サービスの正式名称。

source: sa_handler*: proc (x: cint) {.noconv.} ## Pointer to a signal-catching
ja: sa_handler*: proc (x: cint) {.noconv.} ## シグナル補足関数のポインタ、

source: sa_mask*: Sigset ## Set of signals to be blocked during execution of
ja: sa_mask*: Sigset ## シグナルをブロックしているときに

source: same as [a-zA-Z_][a-zA-z_0-9]*; standard identifier Source Edit
ja: same as [a-zA-Z_][a-zA-z_0-9]*; standard identifier ソース 編集

source: same as \d+ Source Edit
ja: same as \d+ ソース 編集

source: same as fastRows, but slower and safe.
ja: fastRows と似ていますが、安全性を優先しているため処理速度は遅いです。

source: same as find(s, pattern, matches, start) >= 0 Source Edit
ja: same as find(s, pattern, matches, start) >= 0 ソース 編集

source: same as find(s, pattern, start) >= 0 Source Edit
ja: same as find(s, pattern, start) >= 0 ソース 編集

source: same as fastRows but returns a handle that can be used to get column text on demand using [].
ja: fastRows と似ていますが、 [] で要求されたテキスト列の取得に使えるハンドルを返します。

source: sameFile proc
ja: sameFile プロシージャ

source: sameFileContent proc
ja: sameFileContent プロシージャ

source: sched_ss_low_priority*: cint ## Low scheduling priority for
ja: sched_ss_low_priority*: cint ## スポラディックサーバー (孤発型サーバー) の

source: sched_ss_repl_period*: Timespec ## Replenishment period for
ja: sched_ss_repl_period*: Timespec ## スポラディックサーバーの

source: searchExtPos proc
ja: searchExtPos プロシージャ

source: second argument to socket proc Source Edit
ja: second argument to socket proc ソース 編集

source: see docs Source Edit
ja: ドキュメントを参照 ソース 編集

source: semfold constant
ja: semfold 定数

source: sends a signal to the condition variable cond.
ja: 状態変数 cond にシグナルを送信します。

source: set CONFIG_TCCDIR at runtime Source Edit
ja: ランタイムに CONFIG_TCCDIR を設定します ソース 編集

source: set a options Source Edit
ja: オプションを設定します ソース 編集

source: set an environment variable
ja: 環境変数の設定

source: set error/warning display callback Source Edit
ja: エラー・警告表示用のコールバックを設定します ソース 編集

source: set output type.
ja: 出力形式を設定します。

source: set this to change the sampling frequency.
ja: これはサンプリング周波数の設定を変更します。

source: setCurrentDir proc
ja: setCurrentDir プロシージャ

source: setFilePermissions proc
ja: setFilePermissions プロシージャ

source: sets the encoding of a database connection, returns true for success, false for failure.
ja: データベース接続のエンコーディングを設定します。成功時は true を、失敗時は false を返します。

source: sets the position of the file pointer that is used for read/write operations.
ja: 読み書き処理で使うファイルポインタの位置を設定します。

source: settings resulting in a seq of string values Source Edit
ja: 設定値の結果は文字列のシーケンス (seq) となります ソース 編集

source: settings resulting in a single string value Source Edit
ja: 設定値の結果は単一文字列となります ソース 編集

source: shallow pragma
ja: shallow プラグマ

source: should be equivalent to
ja: 等価なコードにするには

source: should return an int with the < 0 == 0 or > 0 semantics; for a bool result use sameXYZ
ja: < 0 == 0 または > 0 のセマンティクスでは int を返してください。 bool の結果では sameXYZ をお使いください。

source: should return the position where something was found; for a bool result use contains
ja: 対象の検出位置を返してください。 bool の結果では contains をお使いください

source: show all command line switches
ja: コマンドラインスイッチの説明をすべて表示します

source: show detailed version information
ja: バージョン情報の詳細を表示します

source: show this help
ja: このヘルプを表示します

source: shows the version
ja: バージョンを表示します。

source: shows this help
ja: このヘルプを表示します。

source: si_errno*: cint ## If non-zero, an errno value associated with
ja: si_errno*: cint 非ゼロならば、このシグナルと関連する

source: sigev_notify_function*: proc (x: SigVal) {.noconv.} ## Notification func.
ja: sigev_notify_function*: proc (x: SigVal) {...}{.noconv.} ## 通知関数。

source: siginfo_t Source Edit
ja: siginfo_t 構造体 ソース 編集

source: singly linked lists
ja: 単方向連結リスト

source: size increased Source Edit
ja: size increased ソース 編集

source: size of a buffered socket's buffer Source Edit
ja: size of a buffered socket's buffer ソース 編集

source: size should refer to a byte size
ja: size はバイト単位によるサイズの表記です

source: sizeof computations
ja: sizeof の計算

source: socket type Source Edit
ja: socket type ソース 編集

source: specifies how bindSym behaves Source Edit
ja: specifies how bindSym behaves ソース 編集

source: splitFile proc
ja: splitFile プロシージャ

source: splitPath proc
ja: splitPath プロシージャ

source: st_blksize*: Blksize ## A file system-specific preferred I/O block size
ja: st_blksize*: Blksize ## このオブジェクトにおける特定のファイルシステムでの

source: stack_t Source Edit
ja: stack_t 構造体 ソース 編集

source: startProcess proc
ja: startProcess プロシージャ

source: stores an arbitrary IP address Source Edit
ja: stores an arbitrary IP address ソース 編集

source: streams module
ja: streams モジュール

source: stringify for Message.
ja: Message の文字列化 (stringify) です。

source: struct addrinfo Source Edit
ja: addrinfo 構造体 ソース 編集

source: struct cmsghdr Source Edit
ja: cmsghdr 構造体 ソース 編集

source: struct group Source Edit
ja: group 構造体 ソース 編集

source: struct hostent Source Edit
ja: hostent 構造体 ソース 編集

source: struct if_nameindex Source Edit
ja: if_nameindex 構造体 ソース 編集

source: struct in6_addr Source Edit
ja: in6_addr 構造体 ソース 編集

source: struct in_addr Source Edit
ja: in_addr 構造体 ソース 編集

source: struct iovec Source Edit
ja: iovec 構造体 ソース 編集

source: struct ipc_perm Source Edit
ja: ipc_perm 構造体 ソース 編集

source: struct ipv6_mreq Source Edit
ja: ipv6_mreq 構造体 ソース 編集

source: struct itimerspec Source Edit
ja: itimerspec 構造体 ソース 編集

source: struct linger Source Edit
ja: linger 構造体 ソース 編集

source: struct msghdr Source Edit
ja: msghdr 構造体 ソース 編集

source: struct netent Source Edit
ja: netent 構造体 ソース 編集

source: struct passwd Source Edit
ja: passwd 構造体 ソース 編集

source: struct pollfd Source Edit
ja: pollfd 構造体 ソース 編集

source: struct protoent Source Edit
ja: protoent 構造体 ソース 編集

source: struct sched_param Source Edit
ja: sched_param 構造体 ソース 編集

source: struct servent Source Edit
ja: servent 構造体 ソース 編集

source: struct sigaction Source Edit
ja: sigaction 構造体 ソース 編集

source: struct sigevent Source Edit
ja: sigevent 構造体 ソース 編集

source: struct sigstack Source Edit
ja: sigstack 構造体 ソース 編集

source: struct sigval Source Edit
ja: sigval 構造体 ソース 編集

source: struct sockaddr Source Edit
ja: sockaddr 構造体 ソース 編集

source: struct sockaddr_in Source Edit
ja: sockaddr_in 構造体 ソース 編集

source: struct sockaddr_in6 Source Edit
ja: sockaddr_in6 構造体 ソース 編集

source: struct sockaddr_storage Source Edit
ja: sockaddr_storage 構造体 ソース 編集

source: struct sockaddr_un Source Edit
ja: sockaddr_un 構造体 ソース 編集

source: struct stat Source Edit
ja: stat 構造体 ソース 編集
